package com.test;

/*
 * 方法重写和方法重载的区别 方法重载能改变返回值类型吗
 * 
 * 方法重写   在子类中 出现和父类中一模一样的方法声明的现象
 * 方法重载   同一个类中 出现的方法名相同 参数列表不同的现象
 * 
 * 方法重载能改变返回值类型 因为它和返回值类型无类
 * 
 * Override 方法重写
 * Overload 方法重载
 * 
 * 
 * this关键字和super关键字分别代表什么 以及他们各自的使用场景和作用
 * 
 * this 代表当前类的对象引用
 * super 代表父类存储空间的标识 (可以理解为父类的引用 通过这个东西可以访问父类的成员)
 * 
 * 场景
 *    成员变量 
 *       this.成员变量
 *       super.成员变量
 *    构造方法
 *       this(...)
 *       super(...)
 *    成员方法
 *       this.成员方法
 *       super.成员方法
 */
public class Test {

}
